select count(distinct udid )
from
(select udid
from dwd_logs.dwd_bobo_fast CROSS JOIN UNNEST(split(abid,',')) AS t (subabid)
where dt ='20180512'  and eventid = 'app_start' and (resolve_ip(ip)[3] not in ('北京',
'上海',
'广州',
'深圳',
'成都',
'杭州',
'德阳',
'珠海',
'都江堰',
'广汉',
'海外',
'香港',
'澳门',
'台湾') or t.subabid in ('672-102','673-102','670-102','671-102','706-102','707-102','773-102','772-102','308-102','307-102','741-102','743-102',
'744-102','745-102','784-102','785-102','782-102','783-102','780-102','781-102','778-102','779-102','774-102','775-102','776-102','777-102','735-102',
'736-102')) group by 1) t1
